https://raw.githubusercontent.com/NayakwadiS/mftool/master/Scheme_codes.txt

In [2]:
from mftool import Mftool
import pandas as pd

mf = Mftool()

equity = ["0P0000XW4O", "0P0000XW4V", "0P0000XVJR"]
debt = []
hybrid = []
temp_list = []
for fund in equity:
    temp_list.append(mf.history(fund,start='2018-08-29',end='2023-08-29',as_dataframe=True))

equity_dfs = dict(zip(equity, temp_list))

[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed

In [38]:
equity_dfs['0P0000XW9N']

                  nav  dayChange
date
29-08-2018  56.935200        NaN
30-08-2018  57.033798   0.098598
31-08-2018  57.325100   0.291302
03-09-2018  57.248798  -0.076302
04-09-2018  56.075699  -1.173100
...               ...        ...
21-11-2022  89.631599  -0.145004
22-11-2022  89.263199  -0.368401
23-11-2022  89.737701   0.474503
24-11-2022  90.252701   0.514999
25-11-2022  90.736801   0.484100

[1022 rows x 2 columns]

In [3]:
for fund in equity:
    equity_dfs[fund].reset_index(inplace=True)
    equity_dfs[fund].drop(columns='dayChange',inplace=True)
    equity_dfs[fund].dropna()

In [4]:
for fund in equity:
    print(equity_dfs[fund].shape)

(1228, 2)
(1228, 2)
(1229, 2)
(1228, 2)

In [5]:
temp_df = equity_dfs

In [6]:
for fund in equity:
    temp_df[fund]["date"] = pd.to_datetime(temp_df[fund]["date"])

C:\Users\Admin\AppData\Local\Temp\ipykernel_6804\3706023477.py:2: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  temp_df[fund]["date"] = pd.to_datetime(temp_df[fund]["date"])
C:\Users\Admin\AppData\Local\Temp\ipykernel_6804\3706023477.py:2: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  temp_df[fund]["date"] = pd.to_datetime(temp_df[fund]["date"])
C:\Users\Admin\AppData\Local\Temp\ipykernel_6804\3706023477.py:2: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  temp_df[fund]["date"] = pd.to_datetime(temp_df[fund]["date"])
C:\Users\Admin\AppData\Local\Temp\ipykernel_6804\3706023477.py:2: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  temp_df[fund]["date"] = pd.to_datetime(temp_df[fund]["date"])

In [7]:
for fund in equity:
    temp_df[fund] = temp_df[fund].dropna()

In [8]:
temp_df

{'0P0000XW4O':            date        nav
 0    2018-08-29   8.954200
 1    2018-08-30   8.968300
 2    2018-08-31   8.999300
 3    2018-09-03   8.949500
 4    2018-09-04   8.745500
 ...         ...        ...
 1223 2023-08-22  27.003401
 1224 2023-08-23  27.037399
 1225 2023-08-24  26.988100
 1226 2023-08-25  26.677099
 1227 2023-08-28  26.866600

 [1228 rows x 2 columns],
 '0P0000XW4V':            date         nav
 0    2018-08-29   60.523399
 1    2018-08-30   60.518700
 2    2018-08-31   60.759701
 3    2018-09-03   60.364899
 4    2018-09-04   59.703499
 ...         ...         ...
 1223 2023-08-22  172.451706
 1224 2023-08-23  172.381699
 1225 2023-08-24  171.318497
 1226 2023-08-25  170.410294
 1227 2023-08-28  171.585999

 [1228 rows x 2 columns],
 '0P0000XVJR':            date         nav
 0    2018-08-29  118.877998
 1    2018-08-30  119.347000
 2    2018-08-31  119.894997
 3    2018-09-03  119.373001
 4    2018-09-04  116.775002
 ...         ...         ...
 1224 2023-08-22  288.583008
 1225 2023-08-23  289.911499
 1226 2023-08-24  290.327301
 1227 2023-08-25  288.525208
 1228 2023-08-28  290.282715

 [1229 rows x 2 columns],
 '0P0000XVB8':            date        nav
 0    2018-08-29  22.157000
 1    2018-08-30  22.198000
 2    2018-08-31  22.320999
 3    2018-09-03  22.205999
 4    2018-09-04  21.742001
 ...         ...        ...
 1223 2023-08-22  51.707001
 1224 2023-08-23  51.745998
 1225 2023-08-24  51.700001
 1226 2023-08-25  51.414001
 1227 2023-08-28  51.765999

 [1228 rows x 2 columns]}

In [9]:
i=1
for df in temp_df.values():
    df.rename(columns={'nav':f"nav_{i}"},inplace=True)
    i+=1

In [10]:
temp_df

{'0P0000XW4O':            date      nav_1
 0    2018-08-29   8.954200
 1    2018-08-30   8.968300
 2    2018-08-31   8.999300
 3    2018-09-03   8.949500
 4    2018-09-04   8.745500
 ...         ...        ...
 1223 2023-08-22  27.003401
 1224 2023-08-23  27.037399
 1225 2023-08-24  26.988100
 1226 2023-08-25  26.677099
 1227 2023-08-28  26.866600

 [1228 rows x 2 columns],
 '0P0000XW4V':            date       nav_2
 0    2018-08-29   60.523399
 1    2018-08-30   60.518700
 2    2018-08-31   60.759701
 3    2018-09-03   60.364899
 4    2018-09-04   59.703499
 ...         ...         ...
 1223 2023-08-22  172.451706
 1224 2023-08-23  172.381699
 1225 2023-08-24  171.318497
 1226 2023-08-25  170.410294
 1227 2023-08-28  171.585999

 [1228 rows x 2 columns],
 '0P0000XVJR':            date       nav_3
 0    2018-08-29  118.877998
 1    2018-08-30  119.347000
 2    2018-08-31  119.894997
 3    2018-09-03  119.373001
 4    2018-09-04  116.775002
 ...         ...         ...
 1224 2023-08-22  288.583008
 1225 2023-08-23  289.911499
 1226 2023-08-24  290.327301
 1227 2023-08-25  288.525208
 1228 2023-08-28  290.282715

 [1229 rows x 2 columns],
 '0P0000XVB8':            date      nav_4
 0    2018-08-29  22.157000
 1    2018-08-30  22.198000
 2    2018-08-31  22.320999
 3    2018-09-03  22.205999
 4    2018-09-04  21.742001
 ...         ...        ...
 1223 2023-08-22  51.707001
 1224 2023-08-23  51.745998
 1225 2023-08-24  51.700001
 1226 2023-08-25  51.414001
 1227 2023-08-28  51.765999

 [1228 rows x 2 columns]}

In [11]:
merge_df=pd.DataFrame()

for df in temp_df.values(): 
    if merge_df.empty:
        merge_df=df
    else:
        merge_df=pd.merge(merge_df,df,on='date',how='left')    
        
        
print(merge_df)

           date      nav_1       nav_2       nav_3      nav_4
0    2018-08-29   8.954200   60.523399  118.877998  22.157000
1    2018-08-30   8.968300   60.518700  119.347000  22.198000
2    2018-08-31   8.999300   60.759701  119.894997  22.320999
3    2018-09-03   8.949500   60.364899  119.373001  22.205999
4    2018-09-04   8.745500   59.703499  116.775002  21.742001
...         ...        ...         ...         ...        ...
1223 2023-08-22  27.003401  172.451706  288.583008  51.707001
1224 2023-08-23  27.037399  172.381699  289.911499  51.745998
1225 2023-08-24  26.988100  171.318497  290.327301  51.700001
1226 2023-08-25  26.677099  170.410294  288.525208  51.414001
1227 2023-08-28  26.866600  171.585999  290.282715  51.765999

[1228 rows x 5 columns]

In [12]:
for df in temp_df.values():
    print(df)

           date      nav_1
0    2018-08-29   8.954200
1    2018-08-30   8.968300
2    2018-08-31   8.999300
3    2018-09-03   8.949500
4    2018-09-04   8.745500
...         ...        ...
1223 2023-08-22  27.003401
1224 2023-08-23  27.037399
1225 2023-08-24  26.988100
1226 2023-08-25  26.677099
1227 2023-08-28  26.866600

[1228 rows x 2 columns]
           date       nav_2
0    2018-08-29   60.523399
1    2018-08-30   60.518700
2    2018-08-31   60.759701
3    2018-09-03   60.364899
4    2018-09-04   59.703499
...         ...         ...
1223 2023-08-22  172.451706
1224 2023-08-23  172.381699
1225 2023-08-24  171.318497
1226 2023-08-25  170.410294
1227 2023-08-28  171.585999

[1228 rows x 2 columns]
           date       nav_3
0    2018-08-29  118.877998
1    2018-08-30  119.347000
2    2018-08-31  119.894997
3    2018-09-03  119.373001
4    2018-09-04  116.775002
...         ...         ...
1224 2023-08-22  288.583008
1225 2023-08-23  289.911499
1226 2023-08-24  290.327301
1227 2023-08-25  288.525208
1228 2023-08-28  290.282715

[1229 rows x 2 columns]
           date      nav_4
0    2018-08-29  22.157000
1    2018-08-30  22.198000
2    2018-08-31  22.320999
3    2018-09-03  22.205999
4    2018-09-04  21.742001
...         ...        ...
1223 2023-08-22  51.707001
1224 2023-08-23  51.745998
1225 2023-08-24  51.700001
1226 2023-08-25  51.414001
1227 2023-08-28  51.765999

[1228 rows x 2 columns]

In [13]:
merge_df.dtypes

date     datetime64[ns]
nav_1           float64
nav_2           float64
nav_3           float64
nav_4           float64
dtype: object

In [50]:
merge_df.dtypes

date     datetime64[ns]
nav_1           float64
nav_2           float64
nav_3           float64
nav_4           float64
nav_5           float64
dtype: object

In [14]:
index_df=pd.read_csv("^NSEI.csv")

In [15]:
index_df.drop(columns=['Open','High','Low','Adj Close','Volume'],inplace=True)
index_df['Date']=pd.to_datetime(index_df['Date'])

In [16]:
index_df

           Date         Close
0    2018-08-31  11680.500000
1    2018-09-03  11582.349609
2    2018-09-04  11520.299805
3    2018-09-05  11476.950195
4    2018-09-06  11536.900391
...         ...           ...
1229 2023-08-24  19386.699219
1230 2023-08-25  19265.800781
1231 2023-08-28  19306.050781
1232 2023-08-29  19342.650391
1233 2023-08-30  19347.449219

[1234 rows x 2 columns]

In [71]:
i=1
for i in range(1,6):
    print(merge_df[f"nav_{i}"])

0        8.954200
1        8.968300
2        8.999300
3        8.949500
4        8.745500
          ...
1223    27.003401
1224    27.037399
1225    26.988100
1226    26.677099
1227    26.866600
Name: nav_1, Length: 1228, dtype: float64
0        60.523399
1        60.518700
2        60.759701
3        60.364899
4        59.703499
           ...
1223    172.451706
1224    172.381699
1225    171.318497
1226    170.410294
1227    171.585999
Name: nav_2, Length: 1228, dtype: float64
0       118.877998
1       119.347000
2       119.894997
3       119.373001
4       116.775002
           ...
1223    288.583008
1224    289.911499
1225    290.327301
1226    288.525208
1227    290.282715
Name: nav_3, Length: 1228, dtype: float64
0       22.157000
1       22.198000
2       22.320999
3       22.205999
4       21.742001
          ...
1223    51.707001
1224    51.745998
1225    51.700001
1226    51.414001
1227    51.765999
Name: nav_4, Length: 1228, dtype: float64
0       23.792101
1       23.659300
2       23.543200
3       23.325800
4       22.900700
          ...
1223    33.403702
1224    33.601200
1225    33.851501
1226    33.767300
1227    33.682098
Name: nav_5, Length: 1228, dtype: float64

In [18]:
i=1
for i in range(1,5):
    merge_df[f"nav_{i}"]=merge_df[f"nav_{i}"]/merge_df[f"nav_{i}"][0]
index_df['Close_nrml']= index_df['Close']/index_df['Close'][0]

In [76]:
merge_df

           date     nav_1     nav_2     nav_3     nav_4     nav_5
0    2018-08-29  1.000000  1.000000  1.000000  1.000000  1.000000
1    2018-08-30  1.001575  0.999922  1.003945  1.001850  0.994418
2    2018-08-31  1.005037  1.003904  1.008555  1.007402  0.989538
3    2018-09-03  0.999475  0.997381  1.004164  1.002211  0.980401
4    2018-09-04  0.976692  0.986453  0.982310  0.981270  0.962534
...         ...       ...       ...       ...       ...       ...
1223 2023-08-22  3.015725  2.849339  2.427556  2.333664  1.403983
1224 2023-08-23  3.019522  2.848183  2.438731  2.335424  1.412284
1225 2023-08-24  3.014016  2.830616  2.442229  2.333348  1.422804
1226 2023-08-25  2.979283  2.815610  2.427070  2.320441  1.419265
1227 2023-08-28  3.000447  2.835036  2.441854  2.336327  1.415684

[1228 rows x 6 columns]

In [24]:
merge_df.to_csv("check.csv")
index_df.to_csv('index.csv')

In [20]:
#merge_df['avg']=(merge_df['nav_1'] + merge_df['nav_2'] + merge_df['nav_3'] + merge_df['nav_4'] + merge_df['nav_5'])/5
merge_df['avg']=merge_df[['nav_1','nav_2','nav_3','nav_4']].mean(axis=1)

In [23]:
merge_df['avg']=merge_df['avg']*100
index_df['Close_nrml']=index_df['Close_nrml']*100

In [25]:
merge_df

           date     nav_1     nav_2     nav_3     nav_4           avg
0    2018-08-29  1.000000  1.000000  1.000000  1.000000  10000.000000
1    2018-08-30  1.001575  0.999922  1.003945  1.001850  10018.231803
2    2018-08-31  1.005037  1.003904  1.008555  1.007402  10062.244360
3    2018-09-03  0.999475  0.997381  1.004164  1.002211  10008.079359
4    2018-09-04  0.976692  0.986453  0.982310  0.981270   9816.813348
...         ...       ...       ...       ...       ...           ...
1223 2023-08-22  3.015725  2.849339  2.427556  2.333664  26565.711198
1224 2023-08-23  3.019522  2.848183  2.438731  2.335424  26604.650054
1225 2023-08-24  3.014016  2.830616  2.442229  2.333348  26550.523135
1226 2023-08-25  2.979283  2.815610  2.427070  2.320441  26356.010002
1227 2023-08-28  3.000447  2.835036  2.441854  2.336327  26534.159016

[1228 rows x 6 columns]